БухЭксп/InformationRegisters/CW_ТаблицаРегистрацииИзменений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ТаблицаРегистрацииИзменений</Name>
			<Comment>Таблица регистрации изменений к выгрузке</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_РежимыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_СтатусыВыгрузки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПризнакСозданияОбъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаВыгрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_СистемныеСообщения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Обмен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Обмены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Метаданное</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МетаданныеКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СинхронизацияОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СинхронизацияОбъектов</Name>
			<Comment>Синхронизация объектов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Источник_Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Источник_Тип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МетаданныеКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопИнфо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолитикаСинхронизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПолитикаСинхронизацииОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>флНезавершена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Источник_Идентификатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Обмены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Источник_УИД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Источник_СИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приемник_Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приемник_УИД</Name>
					<Comment>Уид бух. базы</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ИдентификаторыОбъектовДляВнешнихБД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ИдентификаторыОбъектовДляВнешнихБД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Обмен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Обмены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Метаданное</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МетаданныеКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_Счетчики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_Счетчики</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ИдентификаторыСчетчиков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_РегламентныеЗадания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_РегламентныеЗадания</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_СтатусыВыгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_СтатусыВыгрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зарегистрирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Загружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_РежимыЗаписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_РежимыЗаписи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запись</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПометкаУдаления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проведение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ПолитикаСинхронизацииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПолитикаСинхронизацииОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Постоянная</Name>
					<Comment>Обновлять объект при каждой загрузке</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Первичная</Name>
					<Comment>Не обновлять объект, если уже есть синхронизация</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/CommonModules/CW_Обмены/Ext/Module.bsl
Функция ОбъектРегистрируется(Объект) Экспорт 
	// --- 
	
	МС = CW_Обмены_ПИ.МетаданноеКонфигурации(Объект.Метаданные().ПолноеИмя());	
	Возврат(CW_Обмены_ПИ.МетаданноеРегистрируется(МС)); 
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

Процедура ЗаписатьПараметрыРегистрации(Объект,СтруктураПараметровРегистрации,Отказ) Экспорт 
	// --- 
	
	СП = СтруктураПараметровРегистрации;
	
	// грохаем то, что уже есть по комбинации обмен-объект
	// --- 
	НЗ = РегистрыСведений.CW_ТаблицаРегистрацииИзменений.СоздатьНаборЗаписей();
	// --- 
	НЗ.Отбор.Обмен.Значение = СП.Обмен;
	НЗ.Отбор.Обмен.Использование = Истина;
	НЗ.Отбор.Объект.Значение = Объект.Ссылка;
	НЗ.Отбор.Объект.Использование = Истина;
	Если _сф.ст_ПолучитьСвойство(СП,"Объект") <> Неопределено Тогда
		НЗ.Отбор.Объект.Значение = _сф.ст_ПолучитьСвойство(СП,"Объект");
	КонецЕсли; 
	// --- 
	НЗ.Прочитать();
	// --- 
	// смотрим, не было ли у зарегистрированных объектов отметки новых
	ТО = _сф.т_Создать("Обмен,Объект,ЭтоНовый");
	Для каждого Стр Из НЗ Цикл
		
		Если Стр.ПризнакСозданияОбъекта Тогда
			
			Нстр = ТО.Добавить();
			Нстр.Обмен = Стр.Обмен;
			Нстр.Объект = Стр.Объект;
			// --- 
			Нстр.ЭтоНовый = Стр.ПризнакСозданияОбъекта;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// --- 
	НЗ.Очистить();
	НЗ.Записать(Истина);
	
	// формируем записи
	Для каждого СтруктураЗаписи Из СП.МассивЗаписей Цикл
		
		Запись = РегистрыСведений.CW_ТаблицаРегистрацииИзменений.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись,СтруктураЗаписи);
		Если СтруктураЗаписи.Объект = Неопределено Тогда
			
			Запись.Объект = Объект.Ссылка;
			
		Иначе
			
			Если НЕ ЗначениеЗаполнено(СтруктураЗаписи.Объект) Тогда
				
				Запись.Объект = Объект.Ссылка;
				
			КонецЕсли; 
			
		КонецЕсли; 
		// проверяем, что объект не новый
		Запись.ПризнакСозданияОбъекта = СтруктураЗаписи.ЭтоНовый;
		СтрокаТО = _сф.к_НайтиСтроку(ТО,Новый Структура("Обмен,Объект",Запись.Обмен,Запись.Объект));
		Если СтрокаТО <> Неопределено Тогда
			
			Запись.ПризнакСозданияОбъекта = Истина;
			
		КонецЕсли; 
		// --- 
		Запись.Записать(Истина);
		
	КонецЦикла; 
		
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

Процедура УстановитьСтатусОбъекта(Обмен,ПараметрыОбъекта,Статус=Неопределено,СообщениеСсылка=Неопределено) Экспорт 
	// --- 
	
	// получаем запись 
	НЗ = РегистрыСведений.CW_ТаблицаРегистрацииИзменений.СоздатьНаборЗаписей();
	_сф.УстановитьОтбор(НЗ.Отбор,"Обмен",Обмен);
	_сф.УстановитьОтбор(НЗ.Отбор,"Объект",ПараметрыОбъекта.Объект);
	НЗ.Прочитать();
	
	// меняем статус
	
	Запись = _сф.к_ПервыйЭлемент(НЗ);
	Если (Статус <> Неопределено) Тогда
		Запись.Статус = Статус;
		Запись.ОшибкаВыгрузки = Ложь;
	Иначе
		Запись.ОшибкаВыгрузки = Истина;
	КонецЕсли; 
	
	Если (СообщениеСсылка <> Неопределено) Тогда
		Запись.ОписаниеОшибки = СообщениеСсылка;
	КонецЕсли;
	
	Если Статус = Перечисления.CW_СтатусыВыгрузки.Выгружен Тогда
		
		Запись.ПризнакСозданияОбъекта = Ложь;
		
	КонецЕсли; 
	
	// --- 
	
	НЗ.Записать(Истина);
	
	// --- 
КонецПроцедуры
// --- 
Процедура УдалитьРегистрациюОбъекта(Обмен,ПараметрыОбъекта) Экспорт 
	
	// получаем запись 
	НЗ = РегистрыСведений.CW_ТаблицаРегистрацииИзменений.СоздатьНаборЗаписей();
	_сф.УстановитьОтбор(НЗ.Отбор,"Обмен",Обмен);
	_сф.УстановитьОтбор(НЗ.Отбор,"Объект",ПараметрыОбъекта.Объект);
	НЗ.Прочитать();
	
	Запись = _сф.к_ПервыйЭлемент(НЗ);
	Если (Запись.Статус = Перечисления.CW_СтатусыВыгрузки.Выгружен) Тогда
		
		НЗ.Очистить();
		
	КонецЕсли; 
	
	// --- 
	
	НЗ.Записать(Истина);
	
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

Функция СтруктураЗаписиТаблицыРегистрации(Объект,СО) Экспорт 
	// --- 
	
	СЗ = _сф.ст_Создать("Обмен,Метаданное,Объект,ЭтоНовый,ДатаИзменения,РежимЗаписи,Статус");
	СЗ.Обмен 			= СО.Обмен;
	СЗ.Метаданное 		= СО.Метаданное;
	СЗ.Объект			= Объект.Ссылка;
	СЗ.ЭтоНовый			= _сф.ст_ПолучитьСвойство(СО,"ЭтоНовый");
	Если СЗ.ЭтоНовый = Неопределено Тогда
		
		СЗ.ЭтоНовый  = Ложь;
		
	КонецЕсли; 
	СЗ.ДатаИзменения 	= СО.ДатаИзменения;
	СЗ.РежимЗаписи		= СО.РежимЗаписи;
	СЗ.Статус			= Перечисления.CW_СтатусыВыгрузки.Зарегистрирован;
	
	Возврат(СЗ);
	
	// --- 
КонецФункции

Функция РежимЗаписиОбъекта(Объект,ПараметрыРегистрации,Режим=Неопределено) Экспорт 
	
	Если Найти(ПараметрыРегистрации.Метаданное.Наименование,"Справочник.") <> 0 Тогда
		// справочники
		Если Объект.ПометкаУдаления Тогда
			Возврат Перечисления.CW_РежимыЗаписи.ПометкаУдаления;
		Иначе
			Возврат Перечисления.CW_РежимыЗаписи.Запись;
		КонецЕсли; 
		
	ИначеЕсли Найти(ПараметрыРегистрации.Метаданное.Наименование,"Документ.") <> 0 Тогда 
		// документы
		Если Объект.ПометкаУдаления Тогда
			Возврат Перечисления.CW_РежимыЗаписи.ПометкаУдаления;
			
		ИначеЕсли Режим = РежимЗаписиДокумента.Проведение Тогда
			Возврат Перечисления.CW_РежимыЗаписи.Проведение;
			
		ИначеЕсли Режим = РежимЗаписиДокумента.ОтменаПроведения Тогда 
			Возврат Перечисления.CW_РежимыЗаписи.ОтменаПроведения;
			
		ИначеЕсли Режим = РежимЗаписиДокумента.Запись Тогда 
			Возврат Перечисления.CW_РежимыЗаписи.Запись;
			
		Иначе
			Возврат Перечисления.CW_РежимыЗаписи.Запись;
			
		КонецЕсли;		 
		
	КонецЕсли; 
	
КонецФункции

// ---------------------------------------------------------------------------- 

// запуск регламентного задания выгрузки
Процедура РегламентнаяВыгрузка(Обмен,Параметры) Экспорт 
	// --- 
	
	Отладка = Ложь;
	
	Попытка
		
		Если Отладка Тогда
			
			Таймер = _сф.Таймер_Старт();
			
		КонецЕсли; 
		
		// В регламентном задании в разделе "параметры" должны быть прописаны два поля: обмен и параметры (sic!)? параметры - произвольная структура
		ОбработкаОбъект = _ПО.ПолучитьОбработку(Обмен.Обработка);	
		// регламентный вызов из внешней обработки
		Ответ = ОбработкаОбъект.РегламентныйВызовВыгрузки(Обмен,Параметры);
		
		Если Ответ.Код = 0 Тогда
			
			Если Отладка Тогда
				
				_сф.Таймер_Стоп(Таймер);
				CW_Журнал.ОтладочноеСообщение("Обмен.Общие","Выгрузка по обмену """+Строка(Обмен)+""" выполнена за "+_сф.Таймер_Представление(Таймер)+".");
				
			КонецЕсли; 
			
		КонецЕсли; 
		
				
	Исключение
		
		// регистрируем ошибку
		CW_Журнал.ЗаписатьСообщение("Обмен.Общие","error","Вызов регламентной выгрузки:"+Символы.ПС+"Обмен="+Строка(Обмен)+Символы.ПС+ОписаниеОшибки());
		
	КонецПопытки; 
		
	// --- 
КонецПроцедуры

// запуск регламентного задания загрузки
Процедура РегламентнаяЗагрузка(Обмен,Параметры) Экспорт 
	// --- 
	
	Попытка
		
		// В регламентном задании в разделе "параметры" должны быть прописаны два поля: обмен и параметры (sic!)? параметры - произвольная структура
		ОбработкаОбъект = _ПО.ПолучитьОбработку(Обмен.Обработка);	
		// регламентный вызов из внешней обработки
		Ответ = ОбработкаОбъект.РегламентныйВызовЗагрузки(Обмен,Параметры);
		
	Исключение
		
		// регистрируем ошибку
		CW_Журнал.ЗаписатьСообщение("Обмен.Общие","error","Вызов регламентной загрузки:"+Символы.ПС+"Обмен="+Строка(Обмен)+Символы.ПС+ОписаниеОшибки());
		
	КонецПопытки; 	
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

Функция ЗаписатьСоответствиеВРегистр(ПараметрыЗагрузки,СинхроСтрока) Экспорт 
	
	Попытка
		
		// удаление существующей записи(ей)
		Набор = РегистрыСведений.CW_СинхронизацияОбъектов.СоздатьНаборЗаписей();
		Если ПараметрыЗагрузки.ИспользуетсяUID Тогда
			Набор.Отбор.Источник_УИД.Значение = СинхроСтрока.Источник_УИД;
			Набор.Отбор.Источник_УИД.Использование = Истина;
		Иначе
			Набор.Отбор.Источник_СИ.Значение = СинхроСтрока.Источник_СИ;
			Набор.Отбор.Источник_СИ.Использование = Истина;
		КонецЕсли; 
		Набор.Отбор.Источник_Идентификатор.Значение = ПараметрыЗагрузки.Обмен;
		Набор.Отбор.Источник_Идентификатор.Использование = Истина;
		
		Набор.Записать(Истина);
		Набор.Очистить();
		
		// --- 
		
		Запись = РегистрыСведений.CW_СинхронизацияОбъектов.СоздатьМенеджерЗаписи();
		
		Запись.Источник_Тип				= СинхроСтрока.Источник_Тип;
		Запись.Источник_УИД				= СинхроСтрока.Источник_УИД;
		Запись.Источник_СИ				= СинхроСтрока.Источник_СИ;
		Запись.Приемник_Объект			= СинхроСтрока.Приемник_Объект;
		Если (Синхрострока.Синхронизировано И НЕ СинхроСтрока.СозданиеНового) Тогда
			Запись.Приемник_УИД				= СинхроСтрока.Приемник_Объект.УникальныйИдентификатор();
			Запись.флНезавершена		= Ложь;
		Иначе
			Запись.Приемник_УИД				= СинхроСтрока.Приемник_УИД;	
		КонецЕсли; 
		Запись.Источник_Наименование	= СинхроСтрока.Источник_Наименование;
		Запись.Источник_Идентификатор	= ПараметрыЗагрузки.Обмен;
		
		Если Запись.Приемник_УИД = ПолучитьУИД(Неопределено) Тогда
			
			Запись.флНезавершена = Истина;
			
		КонецЕсли;
		
		Запись.Записать();
		
		Возврат(_УФКС.Ответ());
		
	Исключение
		
		Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
		
	КонецПопытки;
	
КонецФункции

Функция ПолучитьУИД(Строка) Экспорт 
	// --- 
	
	ПустойУИД = "00000000-0000-0000-0000-000000000000";
	
	Если Строка = Неопределено Тогда
		
		Возврат(Новый УникальныйИдентификатор(ПустойУИД));
		
	КонецЕсли; 
	Если Строка = "Неопределено" Тогда
		
		Возврат(Новый УникальныйИдентификатор(ПустойУИД));
		
	КонецЕсли; 
	
	Возврат(Новый УникальныйИдентификатор(Строка));
	
	// --- 
КонецФункции

// --- 

Функция ПолучитьСвязанныеСсылки(ПараметрыЗагрузки,Идентификатор) Экспорт 
	
	МассивСсылок = Новый Массив;
	
	Если ПараметрыЗагрузки.ИспользуетсяUID Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CW_СинхронизацияОбъектов.Приемник_Объект
		|ИЗ
		|	РегистрСведений.CW_СинхронизацияОбъектов КАК CW_СинхронизацияОбъектов
		|ГДЕ
		|	CW_СинхронизацияОбъектов.Источник_УИД = &Источник_УИД
		|	И CW_СинхронизацияОбъектов.Источник_Идентификатор = &Источник_Идентификатор";
		Запрос.УстановитьПараметр("Источник_УИД", Новый УникальныйИдентификатор(Идентификатор));
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CW_СинхронизацияОбъектов.Приемник_Объект
		|ИЗ
		|	РегистрСведений.CW_СинхронизацияОбъектов КАК CW_СинхронизацияОбъектов
		|ГДЕ
		|	CW_СинхронизацияОбъектов.Источник_СИ = &Источник_СИ
		|	И CW_СинхронизацияОбъектов.Источник_Идентификатор = &Источник_Идентификатор";
		Запрос.УстановитьПараметр("Источник_СИ", Идентификатор);
		
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("Источник_Идентификатор", ПараметрыЗагрузки.Обмен);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Для Каждого Стр Из ТЗ Цикл
		 МассивСсылок.Добавить(Стр.Приемник_Объект);
	КонецЦикла;	
	Если МассивСсылок.Количество()=0 Тогда
		
		Возврат(Неопределено);
		
	Иначе
		
		Возврат(МассивСсылок);
		
	КонецЕсли;
	
КонецФункции // ПолучитьСвязанныеСсылки()

Функция ПолучитьСвязаннуюСсылку(ПараметрыЗагрузки,УИД,Тип) Экспорт 
	
	Мстр = ПолучитьСвязанныеСсылки(ПараметрыЗагрузки,УИД);
	Если Мстр <> Неопределено Тогда
		
		Для каждого Стр Из Мстр Цикл
			
			Если ТипЗнч(Стр) = Тип(Тип) Тогда
				
				Возврат(Стр);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат(Неопределено);
	
КонецФункции // ПолучитьСвязаннуюСсылку()

// ---------------------------------------------------------------------------- 

Функция ИдентификаторДляВнешнейБД(Обмен,Объект) Экспорт 
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ИдентификаторыОбъектовДляВнешнихБД.Идентификатор
	|ИЗ
	|	РегистрСведений.CW_ИдентификаторыОбъектовДляВнешнихБД КАК CW_ИдентификаторыОбъектовДляВнешнихБД
	|ГДЕ
	|	CW_ИдентификаторыОбъектовДляВнешнихБД.Обмен = &Обмен
	|	И CW_ИдентификаторыОбъектовДляВнешнихБД.Объект = &Объект";
	Запрос.УстановитьПараметр("Обмен", Обмен);
	Запрос.УстановитьПараметр("Объект", Объект); 
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если ТЗ.Количество() = 0 Тогда
		
		Возврат(Неопределено);
		
	Иначе
		
		ИД = _сф.к_ПервыйЭлемент(ТЗ).Идентификатор;
		
		Если СокрЛП(ИД) = "" Тогда
			
			Возврат(Неопределено);
			
		Иначе
			
			Возврат(ИД);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецФункции

Функция УстановитьИдентификаторДляВнешнейБД(СО,Объект,Идентификатор,ИдентификаторСинхронизации=Неопределено,Дата=Неопределено,Номер=Неопределено) Экспорт 
	// --- 
	
	Попытка
		
		Запись = РегистрыСведений.CW_СинхронизацияОбъектов.СоздатьМенеджерЗаписи();
		// --- 
		Запись.Источник_Идентификатор = СО.Обмен;
		Запись.Источник_СИ = ?(ИдентификаторСинхронизации=Неопределено,Идентификатор,ИдентификаторСинхронизации);
		Запись.Приемник_Объект = Объект;
		Запись.Приемник_УИД = Объект.УникальныйИдентификатор();
		// --- 
		Запись.Источник_Наименование = Строка(Объект);
		Запись.Источник_Тип = Строка(СО.Метаданное);
		Запись.ПолитикаСинхронизации = Перечисления.CW_ПолитикаСинхронизацииОбъектов.Первичная;
		// --- 
		Запись.Записать(Истина);
		
		// ---------------------------------------------------------------------------- 
		
		Запись = РегистрыСведений.CW_ИдентификаторыОбъектовДляВнешнихБД.СоздатьМенеджерЗаписи();
		Запись.Обмен = СО.Обмен;
		Запись.Метаданное = СО.Метаданное;
		Запись.Объект = Объект;
		Запись.Идентификатор = Идентификатор;
		// --- 
		Запись.Дата = ?(Дата=Неопределено,ТекущаяДата(),Дата);
		Запись.Номер = ?(Номер=Неопределено,0,Номер); 
		// --- 
		Запись.Записать(Истина);
		
		// ---------------------------------------------------------------------------- 
		
		Возврат(_УФКС.Ответ());
		
	Исключение
		
		Возврат(_УФКС.Ответ(1));
		
	КонецПопытки; 
	
	
	
	
	// --- 
КонецФункции

// --- 

Функция ИнкрементСчетчика(Счетчик) Экспорт 
	// --- 
	
	НЗ = РегистрыСведений.CW_Счетчики.СоздатьНаборЗаписей();
	_сф.УстановитьОтбор(НЗ.Отбор,"Счетчик",Счетчик);
	НЗ.Прочитать();
	
	Если НЗ.Количество() = 0 Тогда
		
		// неинициализированный счетчик
		НовоеЗначение = 1;
		// --- 
		Запись = НЗ.Добавить();
		Запись.Счетчик = Счетчик;
		Запись.Значение = НовоеЗначение;
		НЗ.Записать(Истина);
		
	Иначе
		
		Запись = _сф.к_ПервыйЭлемент(НЗ);
		НовоеЗначение = Запись.Значение+1;
		Запись.Значение = НовоеЗначение;
		НЗ.Записать(Истина);
		
	КонецЕсли; 
	
	Возврат(НовоеЗначение);
	
	// --- 
КонецФункции
  
// ----------------------------------------------------------------------------

Процедура CW_КонтрольЗаданий() Экспорт
	
	CW_Журнал.ЗаписатьСообщение("Общие.КонтрольРЗ","info","Проверка запущена");	
	
	// проверяем, что собственные регламентные задания запускаются после рестарта сервера
	Запрос = Новый Запрос();
	Запрос.Текст="ВЫБРАТЬ
	             |	CW_РегламентныеЗадания.ИдентификаторЗадания
	             |ИЗ
	             |	РегистрСведений.CW_РегламентныеЗадания КАК CW_РегламентныеЗадания";
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для каждого Стр Из ТЗ Цикл
		
		РЗ = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Стр.ИдентификаторЗадания);
		РЗ.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
